7767517
182 200
Input            data                     0 1 data
MemoryData       322                      0 1 322 0=1 1=1 2=3
MemoryData       324                      0 1 324 0=1 1=1 2=3
BinaryOp         Div_2                    1 1 data 320 0=3 1=1 2=2.550000e+02
BinaryOp         Sub_5                    2 1 320 322 323 0=1
BinaryOp         Div_7                    2 1 323 324 325 0=3
Reshape          Reshape_9                1 1 325 327 0=128 1=128 2=3
Convolution      Conv_11                  1 1 327 891 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=432
HardSwish        Mul_18                   1 1 891 339 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_0              1 2 339 339_splitncnn_0 339_splitncnn_1
ConvolutionDepthWise Conv_19                  1 1 339_splitncnn_1 894 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=144 7=16
ReLU             Relu_20                  1 1 894 342
Convolution      Conv_21                  1 1 342 897 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
BinaryOp         Add_22                   2 1 339_splitncnn_0 897 345 0=0
Convolution      Conv_23                  1 1 345 900 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
ReLU             Relu_24                  1 1 900 348
ConvolutionDepthWise Conv_25                  1 1 348 903 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             Relu_26                  1 1 903 351
Convolution      Conv_27                  1 1 351 906 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1536
Split            splitncnn_1              1 2 906 906_splitncnn_0 906_splitncnn_1
Convolution      Conv_28                  1 1 906_splitncnn_1 909 0=72 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1728
ReLU             Relu_29                  1 1 909 356
ConvolutionDepthWise Conv_30                  1 1 356 912 0=72 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=648 7=72
ReLU             Relu_31                  1 1 912 359
Convolution      Conv_32                  1 1 359 915 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1728
BinaryOp         Add_33                   2 1 906_splitncnn_0 915 362 0=0
Convolution      Conv_34                  1 1 362 918 0=72 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1728
ReLU             Relu_35                  1 1 918 365
ConvolutionDepthWise Conv_36                  1 1 365 921 0=72 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=1 6=1800 7=72
Split            splitncnn_2              1 2 921 921_splitncnn_0 921_splitncnn_1
Pooling          GlobalAveragePool_43     1 1 921_splitncnn_1 374 0=1 4=1
Reshape          Reshape_47               1 1 374 378 0=72
InnerProduct     Gemm_48                  1 1 378 379 0=24 1=1 2=1728
ReLU             Relu_49                  1 1 379 380
InnerProduct     Gemm_50                  1 1 380 381 0=72 1=1 2=1728
HardSigmoid      Div_56                   1 1 381 389 0=1.666667e-01 1=5.000000e-01
Reshape          Reshape_60               1 1 389 397 0=1 1=1 2=72
BinaryOp         Mul_61                   2 1 921_splitncnn_0 397 398 0=2
ReLU             Relu_62                  1 1 398 399
Convolution      Conv_63                  1 1 399 924 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2880
Split            splitncnn_3              1 2 924 924_splitncnn_0 924_splitncnn_1
Convolution      Conv_64                  1 1 924_splitncnn_1 927 0=120 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4800
ReLU             Relu_65                  1 1 927 404
ConvolutionDepthWise Conv_66                  1 1 404 930 0=120 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=3000 7=120
Split            splitncnn_4              1 2 930 930_splitncnn_0 930_splitncnn_1
Pooling          GlobalAveragePool_73     1 1 930_splitncnn_1 413 0=1 4=1
Reshape          Reshape_77               1 1 413 417 0=120
InnerProduct     Gemm_78                  1 1 417 418 0=32 1=1 2=3840
ReLU             Relu_79                  1 1 418 419
InnerProduct     Gemm_80                  1 1 419 420 0=120 1=1 2=3840
HardSigmoid      Div_86                   1 1 420 428 0=1.666667e-01 1=5.000000e-01
Reshape          Reshape_90               1 1 428 436 0=1 1=1 2=120
BinaryOp         Mul_91                   2 1 930_splitncnn_0 436 437 0=2
ReLU             Relu_92                  1 1 437 438
Convolution      Conv_93                  1 1 438 933 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4800
BinaryOp         Add_94                   2 1 924_splitncnn_0 933 441 0=0
Split            splitncnn_5              1 2 441 441_splitncnn_0 441_splitncnn_1
Convolution      Conv_95                  1 1 441_splitncnn_1 936 0=120 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4800
ReLU             Relu_96                  1 1 936 444
ConvolutionDepthWise Conv_97                  1 1 444 939 0=120 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=3000 7=120
Split            splitncnn_6              1 2 939 939_splitncnn_0 939_splitncnn_1
Pooling          GlobalAveragePool_104    1 1 939_splitncnn_1 453 0=1 4=1
Reshape          Reshape_108              1 1 453 457 0=120
InnerProduct     Gemm_109                 1 1 457 458 0=32 1=1 2=3840
ReLU             Relu_110                 1 1 458 459
InnerProduct     Gemm_111                 1 1 459 460 0=120 1=1 2=3840
HardSigmoid      Div_117                  1 1 460 468 0=1.666667e-01 1=5.000000e-01
Reshape          Reshape_121              1 1 468 476 0=1 1=1 2=120
BinaryOp         Mul_122                  2 1 939_splitncnn_0 476 477 0=2
ReLU             Relu_123                 1 1 477 478
Convolution      Conv_124                 1 1 478 942 0=40 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4800
BinaryOp         Add_125                  2 1 441_splitncnn_0 942 481 0=0
Convolution      Conv_126                 1 1 481 945 0=240 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9600
HardSwish        Mul_133                  1 1 945 492 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_134                 1 1 492 948 0=240 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=2160 7=240
HardSwish        Mul_141                  1 1 948 503 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_142                 1 1 503 951 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=19200
Split            splitncnn_7              1 2 951 951_splitncnn_0 951_splitncnn_1
Convolution      Conv_143                 1 1 951_splitncnn_1 954 0=200 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16000
HardSwish        Mul_150                  1 1 954 516 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_151                 1 1 516 957 0=200 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1800 7=200
HardSwish        Mul_158                  1 1 957 527 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_159                 1 1 527 960 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16000
BinaryOp         Add_160                  2 1 951_splitncnn_0 960 530 0=0
Split            splitncnn_8              1 2 530 530_splitncnn_0 530_splitncnn_1
Convolution      Conv_161                 1 1 530_splitncnn_1 963 0=184 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=14720
HardSwish        Mul_168                  1 1 963 541 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_169                 1 1 541 966 0=184 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1656 7=184
HardSwish        Mul_176                  1 1 966 552 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_177                 1 1 552 969 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=14720
BinaryOp         Add_178                  2 1 530_splitncnn_0 969 555 0=0
Split            splitncnn_9              1 2 555 555_splitncnn_0 555_splitncnn_1
Convolution      Conv_179                 1 1 555_splitncnn_1 972 0=184 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=14720
HardSwish        Mul_186                  1 1 972 566 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_187                 1 1 566 975 0=184 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1656 7=184
HardSwish        Mul_194                  1 1 975 577 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_195                 1 1 577 978 0=80 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=14720
BinaryOp         Add_196                  2 1 555_splitncnn_0 978 580 0=0
Convolution      Conv_197                 1 1 580 981 0=480 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=38400
HardSwish        Mul_204                  1 1 981 591 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_205                 1 1 591 984 0=480 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=4320 7=480
Split            splitncnn_10             1 2 984 984_splitncnn_0 984_splitncnn_1
Pooling          GlobalAveragePool_212    1 1 984_splitncnn_1 600 0=1 4=1
Reshape          Reshape_216              1 1 600 604 0=480
InnerProduct     Gemm_217                 1 1 604 605 0=120 1=1 2=57600
ReLU             Relu_218                 1 1 605 606
InnerProduct     Gemm_219                 1 1 606 607 0=480 1=1 2=57600
HardSigmoid      Div_225                  1 1 607 615 0=1.666667e-01 1=5.000000e-01
Reshape          Reshape_229              1 1 615 623 0=1 1=1 2=480
BinaryOp         Mul_230                  2 1 984_splitncnn_0 623 624 0=2
HardSwish        Mul_237                  1 1 624 633 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_238                 1 1 633 987 0=112 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=53760
Split            splitncnn_11             1 2 987 987_splitncnn_0 987_splitncnn_1
Convolution      Conv_239                 1 1 987_splitncnn_1 990 0=672 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=75264
HardSwish        Mul_246                  1 1 990 646 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_247                 1 1 646 993 0=672 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=6048 7=672
Split            splitncnn_12             1 2 993 993_splitncnn_0 993_splitncnn_1
Pooling          GlobalAveragePool_254    1 1 993_splitncnn_1 655 0=1 4=1
Reshape          Reshape_258              1 1 655 659 0=672
InnerProduct     Gemm_259                 1 1 659 660 0=168 1=1 2=112896
ReLU             Relu_260                 1 1 660 661
InnerProduct     Gemm_261                 1 1 661 662 0=672 1=1 2=112896
HardSigmoid      Div_267                  1 1 662 670 0=1.666667e-01 1=5.000000e-01
Reshape          Reshape_271              1 1 670 678 0=1 1=1 2=672
BinaryOp         Mul_272                  2 1 993_splitncnn_0 678 679 0=2
HardSwish        Mul_279                  1 1 679 688 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_280                 1 1 688 996 0=112 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=75264
BinaryOp         Add_281                  2 1 987_splitncnn_0 996 691 0=0
Convolution      Conv_282                 1 1 691 999 0=672 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=75264
HardSwish        Mul_289                  1 1 999 702 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_290                 1 1 702 1002 0=672 1=5 11=5 2=1 12=1 3=2 13=2 4=2 14=2 15=2 16=2 5=1 6=16800 7=672
Split            splitncnn_13             1 2 1002 1002_splitncnn_0 1002_splitncnn_1
Pooling          GlobalAveragePool_297    1 1 1002_splitncnn_1 711 0=1 4=1
Reshape          Reshape_301              1 1 711 715 0=672
InnerProduct     Gemm_302                 1 1 715 716 0=168 1=1 2=112896
ReLU             Relu_303                 1 1 716 717
InnerProduct     Gemm_304                 1 1 717 718 0=672 1=1 2=112896
HardSigmoid      Div_310                  1 1 718 726 0=1.666667e-01 1=5.000000e-01
Reshape          Reshape_314              1 1 726 734 0=1 1=1 2=672
BinaryOp         Mul_315                  2 1 1002_splitncnn_0 734 735 0=2
HardSwish        Mul_322                  1 1 735 744 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_323                 1 1 744 1005 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=107520
Split            splitncnn_14             1 2 1005 1005_splitncnn_0 1005_splitncnn_1
Convolution      Conv_324                 1 1 1005_splitncnn_1 1008 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
HardSwish        Mul_331                  1 1 1008 757 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_332                 1 1 757 1011 0=960 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=24000 7=960
Split            splitncnn_15             1 2 1011 1011_splitncnn_0 1011_splitncnn_1
Pooling          GlobalAveragePool_339    1 1 1011_splitncnn_1 766 0=1 4=1
Reshape          Reshape_343              1 1 766 770 0=960
InnerProduct     Gemm_344                 1 1 770 771 0=240 1=1 2=230400
ReLU             Relu_345                 1 1 771 772
InnerProduct     Gemm_346                 1 1 772 773 0=960 1=1 2=230400
HardSigmoid      Div_352                  1 1 773 781 0=1.666667e-01 1=5.000000e-01
Reshape          Reshape_356              1 1 781 789 0=1 1=1 2=960
BinaryOp         Mul_357                  2 1 1011_splitncnn_0 789 790 0=2
HardSwish        Mul_364                  1 1 790 799 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_365                 1 1 799 1014 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
BinaryOp         Add_366                  2 1 1005_splitncnn_0 1014 802 0=0
Split            splitncnn_16             1 2 802 802_splitncnn_0 802_splitncnn_1
Convolution      Conv_367                 1 1 802_splitncnn_1 1017 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
HardSwish        Mul_374                  1 1 1017 813 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise Conv_375                 1 1 813 1020 0=960 1=5 11=5 2=1 12=1 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=24000 7=960
Split            splitncnn_17             1 2 1020 1020_splitncnn_0 1020_splitncnn_1
Pooling          GlobalAveragePool_382    1 1 1020_splitncnn_1 822 0=1 4=1
Reshape          Reshape_386              1 1 822 826 0=960
InnerProduct     Gemm_387                 1 1 826 827 0=240 1=1 2=230400
ReLU             Relu_388                 1 1 827 828
InnerProduct     Gemm_389                 1 1 828 829 0=960 1=1 2=230400
HardSigmoid      Div_395                  1 1 829 837 0=1.666667e-01 1=5.000000e-01
Reshape          Reshape_399              1 1 837 845 0=1 1=1 2=960
BinaryOp         Mul_400                  2 1 1020_splitncnn_0 845 846 0=2
HardSwish        Mul_407                  1 1 846 855 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_408                 1 1 855 1023 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
BinaryOp         Add_409                  2 1 802_splitncnn_0 1023 858 0=0
Convolution      Conv_410                 1 1 858 1026 0=1280 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=204800
HardSwish        Mul_417                  1 1 1026 869 0=1.666667e-01 1=5.000000e-01
Pooling          GlobalAveragePool_418    1 1 869 870 0=1 4=1
Reshape          Reshape_424              1 1 870 878 0=-1
BatchNorm        BatchNormalization_425   1 1 878 879 0=1280
HardSwish        Mul_432                  1 1 879 888 0=1.666667e-01 1=5.000000e-01
InnerProduct     Gemm_433                 1 1 888 889 0=2 1=1 2=2560
Softmax          Softmax_434              1 1 889 softmax 0=0 1=1
